# InSessionViewSheetSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InSessionViewSheetSet Class
Members See Also
---
Represents the in-session ViewSheetSet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
```

Visual Basic
---
```text
Public Class InSessionViewSheetSet _
	Implements IViewSheetSet, IDisposable
```

Visual C++
---
```text
public ref class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
```

# Remarks
The in-session ViewSheetSet can't be stored in document.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..InSessionViewSheetSet
# See Also
InSessionViewSheetSet Members
Autodesk.Revit.DB Namespace